BOT_VERSION = "Ver 1.4.1"

BOT_DESCRIBE = "DicePP by 梨子"

BOT_AGREEMENT = "1.邀请骰娘, 使用掷骰服务和在群内阅读此协议视为同意并承诺遵守此协议，否则请移除骰娘。\n" \
                "2.不允许禁言骰娘或刷屏掷骰等对骰娘的不友善行为，这些行为将会提高骰娘被制裁的风险。开关骰娘响应请使用.bot on/off。\n" \
                "3.邀请骰娘入群应已事先得到群内同意。因擅自邀请而使骰娘遭遇不友善行为时，邀请者因未履行预见义务而将承担连带责任。\n" \
                "4.禁止将骰娘用于赌博及其他违法犯罪行为，禁止将本骰娘用作TRPG外的用途，禁止拉入非TRPG群。\n" \
                "5.对于设置敏感昵称等无法预见但有可能招致言论审查的行为，骰娘可能会出于自我保护而拒绝提供服务\n" \
                "6.由于技术以及资金原因，无法保证骰娘100%的时间稳定运行，可能不定时停机维护或遭遇冻结，敬请谅解。\n" \
                "7.对于违反协议的行为，骰娘将视情况终止对用户和所在群提供服务。\n" \
                "8.本协议内容可能改动，请注意查看最新协议。\n" \
                "9.本服务最终解释权归服务提供方所有。"

BOT_GIT_LINK = "DicePP说明手册: https://docs.qq.com/doc/DV3hFWUx6VG1MUnhp\n" \
               "源码: https://github.com/pear-studio/nonebot-dicepp"
